Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.TwistAngleStart Property
 Gets or sets the twist angle in degrees at the start of the spiral beam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double TwistAngleStart { get; set; }
Public Property TwistAngleStart As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace